In [2]:
person = {
    "first": "Corey", 
    "last": "Schafer", 
    "email": "CoreyMSchafer@gmail.com"
}

# DataFrame and Series Basics - Selecting rows and columns

In [3]:
people = {
    "first": ["Corey"], 
    "last": ["Schafer"], 
    "email": ["CoreyMSchafer@gmail.com"]
}

In [4]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [5]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame(people)

In [8]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [9]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [10]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [11]:
df[['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [12]:
df.iloc[[0, 1], 2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [13]:
df.loc[[0, 1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [14]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

## Part 3 Indexes - How To Set, Reset, and Use Indexes

In [15]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [16]:
df.set_index('email', inplace=True)

In [17]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com'], dtype='object', name='email')

In [18]:
df.loc['CoreyMSchafer@gmail.com', 'last']

'Schafer'

In [19]:
df.iloc[0]

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [20]:
df.reset_index(inplace=True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

# Part 4 Filtering - Using Conditionals to Filter Rows and Columns

In [21]:
#Filter Mask
# filt = (df['last'] == 'Doe') & (df['first'] == 'John')
filt = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [22]:
df[filt]

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
2        JohnDoe@email.com   John      Doe

In [23]:
df[(df['last'] == 'Doe') ]

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [24]:
df.loc[~filt, 'email']
# ~ stand for negation !

1    JaneDoe@email.com
Name: email, dtype: object

# Part5 Updating Rows and Columns - Modify Data Within DataFrames

In [25]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [26]:
df.columns = ['first_name', 'last_name', 'email']

In [27]:
df

                first_name last_name    email
0  CoreyMSchafer@gmail.com     Corey  Schafer
1        JaneDoe@email.com      Jane      Doe
2        JohnDoe@email.com      John      Doe

In [28]:
df.columns = [x.lower() for x in df.columns]
df

                first_name last_name    email
0  CoreyMSchafer@gmail.com     Corey  Schafer
1        JaneDoe@email.com      Jane      Doe
2        JohnDoe@email.com      John      Doe

In [29]:
df.columns = df.columns.str.replace(' ', '_')
df

                first_name last_name    email
0  CoreyMSchafer@gmail.com     Corey  Schafer
1        JaneDoe@email.com      Jane      Doe
2        JohnDoe@email.com      John      Doe

In [30]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'  }, inplace=True)

In [31]:
df

                     first   last    email
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [32]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

                     first   last                email
0  CoreyMSchafer@gmail.com  Corey              Schafer
1        JaneDoe@email.com   Jane                  Doe
2                     John  Smith  JohnSmith@email.com

In [33]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            Schafer
1        JaneDoe@email.com   Jane                Doe
2                     John    Doe  JohnDoe@email.com

In [34]:
df.loc[2, 'last'] = 'Smith'
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            Schafer
1        JaneDoe@email.com   Jane                Doe
2                     John  Smith  JohnDoe@email.com

In [35]:
df.at[2, 'last'] = 'Doe'

In [36]:
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]['last'] = 'Smith'
df

/home/cesar/Documents/courses/python/pandas-tutorial/.venv/lib/python3.8/site-packages/pandas/core/frame.py:3607: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._set_item(key, value)

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            Schafer
1        JaneDoe@email.com   Jane                Doe
2                     John    Doe  JohnDoe@email.com

In [37]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            Schafer
1        JaneDoe@email.com   Jane                Doe
2                     John  Smith  JohnDoe@email.com

In [38]:
# df['email'].str.lower()
df['email'] =  df['email'].str.lower()
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            schafer
1        JaneDoe@email.com   Jane                doe
2                     John  Smith  johndoe@email.com

In [39]:
df['email'].apply(len)

0     7
1     3
2    17
Name: email, dtype: int64

In [40]:
def update_email(email):
    return email.upper()

In [41]:
df['email'].apply(update_email)

0              SCHAFER
1                  DOE
2    JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [42]:
df['email'] = df['email'].apply(update_email)
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            SCHAFER
1        JaneDoe@email.com   Jane                DOE
2                     John  Smith  JOHNDOE@EMAIL.COM

In [43]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            schafer
1        JaneDoe@email.com   Jane                doe
2                     John  Smith  johndoe@email.com

In [44]:
df['email'].apply(len)

0     7
1     3
2    17
Name: email, dtype: int64

In [45]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [46]:
len(df['email'])

3

In [47]:
df.apply(pd.Series.min)

first    CoreyMSchafer@gmail.com
last                       Corey
email                        doe
dtype: object

In [48]:
df.apply(lambda x: x.min())

first    CoreyMSchafer@gmail.com
last                       Corey
email                        doe
dtype: object

In [49]:
df.applymap(len)

   first  last  email
0     23     5      7
1     17     4      3
2      4     5     17

In [50]:
df.applymap(str.lower)

                     first   last              email
0  coreymschafer@gmail.com  corey            schafer
1        janedoe@email.com   jane                doe
2                     john  smith  johndoe@email.com

In [51]:
df['last'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: last, dtype: object

In [52]:
df['last'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2    Smith
Name: last, dtype: object

In [53]:
df['last'] = df['last'].replace({'Corey': 'Chris', 'Jane': 'Mary'})
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Chris            schafer
1        JaneDoe@email.com   Mary                doe
2                     John  Smith  johndoe@email.com

# Part6 Add/Remove Rows and Columns From DataFrames

In [54]:
df['full_name'] = df['first'] + ' ' + df['last']
df

,first,last,email,full_name
0,CoreyMSchafer@gmail.com,Chris,schafer,CoreyMSchafer@gmail.com Chris
1,JaneDoe@email.com,Mary,doe,JaneDoe@email.com Mary
2,John,Smith,johndoe@email.com,John Smith

In [55]:
df.drop(columns=['first', 'last'], inplace=True)
df

               email                      full_name
0            schafer  CoreyMSchafer@gmail.com Chris
1                doe         JaneDoe@email.com Mary
2  johndoe@email.com                     John Smith

In [56]:
df['full_name'].str.split(' ', expand=True)

                         0      1
0  CoreyMSchafer@gmail.com  Chris
1        JaneDoe@email.com   Mary
2                     John  Smith

In [57]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

,email,full_name,first,last
0,schafer,CoreyMSchafer@gmail.com Chris,CoreyMSchafer@gmail.com,Chris
1,doe,JaneDoe@email.com Mary,JaneDoe@email.com,Mary
2,johndoe@email.com,John Smith,John,Smith

In [58]:
df.append({'first': 'Tony'}, ignore_index=True)

,email,full_name,first,last
0,schafer,CoreyMSchafer@gmail.com Chris,CoreyMSchafer@gmail.com,Chris
1,doe,JaneDoe@email.com Mary,JaneDoe@email.com,Mary
2,johndoe@email.com,John Smith,John,Smith
3,NaN,NaN,Tony,NaN

In [59]:
people = {
    "first": ["Tony", 'Steve'], 
    "last": ["Stark", 'Rogers'], 
    "email": ["IronMan@avenge.com", 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [60]:
df.append(df2, ignore_index=True, sort=False)

,email,full_name,first,last
0,schafer,CoreyMSchafer@gmail.com Chris,CoreyMSchafer@gmail.com,Chris
1,doe,JaneDoe@email.com Mary,JaneDoe@email.com,Mary
2,johndoe@email.com,John Smith,John,Smith
3,IronMan@avenge.com,NaN,Tony,Stark
4,Cap@avenge.com,NaN,Steve,Rogers

In [69]:
df = df.append(df2, ignore_index=True, sort=False)
df

TypeError: append() got an unexpected keyword argument 'inplace'

In [62]:
df.drop(index=4)

,email,full_name,first,last
0,schafer,CoreyMSchafer@gmail.com Chris,CoreyMSchafer@gmail.com,Chris
1,doe,JaneDoe@email.com Mary,JaneDoe@email.com,Mary
2,johndoe@email.com,John Smith,John,Smith
3,IronMan@avenge.com,NaN,Tony,Stark

In [63]:
# df.drop(index=df[df['email'] == 'doe'].index)
filt = df['email'] == 'doe'
df.drop(index=df[filt].index)

,email,full_name,first,last
0,schafer,CoreyMSchafer@gmail.com Chris,CoreyMSchafer@gmail.com,Chris
2,johndoe@email.com,John Smith,John,Smith
3,IronMan@avenge.com,NaN,Tony,Stark
4,Cap@avenge.com,NaN,Steve,Rogers

# Part7 Sorting Data

In [65]:
df.sort_values(by='last', ascending=False)

,email,full_name,first,last
3,IronMan@avenge.com,NaN,Tony,Stark
2,johndoe@email.com,John Smith,John,Smith
4,Cap@avenge.com,NaN,Steve,Rogers
1,doe,JaneDoe@email.com Mary,JaneDoe@email.com,Mary
0,schafer,CoreyMSchafer@gmail.com Chris,CoreyMSchafer@gmail.com,Chris

In [71]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)
df

,email,first,full_name,last
3,IronMan@avenge.com,Tony,NaN,Stark
5,IronMan@avenge.com,Tony,NaN,Stark
2,johndoe@email.com,John,John Smith,Smith
4,Cap@avenge.com,Steve,NaN,Rogers
6,Cap@avenge.com,Steve,NaN,Rogers
1,doe,JaneDoe@email.com,JaneDoe@email.com Mary,Mary
0,schafer,CoreyMSchafer@gmail.com,CoreyMSchafer@gmail.com Chris,Chris

In [73]:
df.sort_index()

,email,first,full_name,last
0,schafer,CoreyMSchafer@gmail.com,CoreyMSchafer@gmail.com Chris,Chris
1,doe,JaneDoe@email.com,JaneDoe@email.com Mary,Mary
2,johndoe@email.com,John,John Smith,Smith
3,IronMan@avenge.com,Tony,NaN,Stark
4,Cap@avenge.com,Steve,NaN,Rogers
5,IronMan@avenge.com,Tony,NaN,Stark
6,Cap@avenge.com,Steve,NaN,Rogers

In [74]:
df['last'].sort_values()

0     Chris
1      Mary
4    Rogers
6    Rogers
2     Smith
3     Stark
5     Stark
Name: last, dtype: object